In [6]:
from datascience import *

# Discussion 6

## Question 1

In [11]:
cost = Table.read_table("cost.csv")
cost

student_name | student_year    | num_semesters | num_units | total_cost
Taylor       | 1st year        | 2             | 26        | 20042.6
Mayra        | Junior Transfer | 2             | 32        | 21519.9
Jacob        | 3rd year        | 6             | 88        | 47364.2
Angeline     | 5th year        | 10            | 149       | 87274.6
Collin       | 2nd             | 4             | 61        | 37482

### a. Calculate avg units per semester

In [12]:
cost.column("num_units") / cost.column("num_semesters")

array([ 13.        ,  16.        ,  14.66666667,  14.9       ,  15.25      ])

### b. Define function to calculate avg cost per semester

In [18]:
def cost_per_semester(semesters, cost):
    return cost / semesters

### c. Apply function and add new column to table

In [20]:
cost_per_sem = cost.apply(cost_per_semester, "num_semesters", "total_cost")
cost = cost.with_column("cost_per_semester", cost_per_sem)
cost

student_name | student_year    | num_semesters | num_units | total_cost | cost_per_semester
Taylor       | 1st year        | 2             | 26        | 20042.6    | 10021.3
Mayra        | Junior Transfer | 2             | 32        | 21519.9    | 10759.9
Jacob        | 3rd year        | 6             | 88        | 47364.2    | 7894.03
Angeline     | 5th year        | 10            | 149       | 87274.6    | 8727.46
Collin       | 2nd             | 4             | 61        | 37482      | 9370.5

## Question 2

In [21]:
departments = Table.read_table("departments.csv")
departments

department | num_students | num_classes | total_funding | is_STEM?
CDSS       | 837          | 103         | 1148364       | True
EECS       | 653          | 95          | 780335        | True
Sociology  | 235          | 36          | 251685        | False
Economics  | 359          | 78          | 600248        | True
English    | 113          | 23          | 99327         | False

### a. Calculate students per class and funding per class

In [22]:
departments.column("num_students") / departments.column("num_classes")

array([ 8.12621359,  6.87368421,  6.52777778,  4.6025641 ,  4.91304348])

In [23]:
departments.column("total_funding") / departments.column("num_classes")

array([ 11149.16504854,   8214.05263158,   6991.25      ,   7695.48717949,
         4318.56521739])

### b. Table that groups STEM and non-STEM departments

In [24]:
departments.group("is_STEM?", sum)

is_STEM? | department sum | num_students sum | num_classes sum | total_funding sum
False    |                | 348              | 59              | 351012
True     |                | 1849             | 276             | 2528947

### c. Pivot table to show funding

In [29]:
departments.pivot("department", "is_STEM?", "total_funding", sum)

is_STEM? | CDSS    | EECS   | Economics | English | Sociology
False    | 0       | 0      | 0         | 99327   | 251685
True     | 1148364 | 780335 | 600248    | 0       | 0